var breadcrumbInfo = function() {
	var menu = {
		"010100": {
			"name": "管理业务要求",
			"children": {
				"10101": "提出业务要求",
				"10102": "审核业务要求",
				"10103": "审批业务要求",
				"10201": "识别业务要求",
				"10202": "审核业务需求"
			}
		},
		"010101": {
			"name": "跨领域识别业务需求",
			"children": {
				"10101": "识别业务要求",
				"10102": "跨领域识别业务要求",
				"10103": "识别业务需求",
				"10104": "审核业务需求",
				"10105": "审批业务需求",
				"10106": "审核业务需求"
			}
		},
		"010102": {
			"name": "业务开发类流程",
			"children": {
				"10101": "审核业务需求",
				"10102": "审批业务需求",
				"10103": "审核架构建议",
				"10104": "审批架构建议",
				"10201": "协商解决方案",
				"10202": "审核解决方案",
				"10203": "审批解决方案",
				"10204": "审批解决方案",
				"10205": "审批解决方案"
			}
		},
		"010103": {
			"name": "数据提取子流程",
			"children": {
				"10101": "审核业务需求",
				"10102": "审批业务需求",
				"10103": "安排业务需求"
			}
		},
		"010104": {
			"name": "数据编辑子流程",
			"children": {
				"10101": "审核业务需求",
				"10102": "提出安全生产建议",
				"10103": "安排业务需求"
			}
		},
		"010105": {
			"name": "外部IT应用和设备类子流程",
			"children": {
				"10101": "审核业务需求",
				"10102": "审核架构建议",
				"10103": "审批架构建议",
				"10104": "提出安全生产建议（内部加签流转）",
				"10105": "审批业务需求",
				"10106": "安排业务需求"
			}
		},
		"010106": {
			"name": "本领域识别业务需求",
			"children": {
				"10101": "识别业务要求",
				"10102": "识别业务需求",
				"10103": "审核业务需求"
			}
		},
		"010107": {
			"name": "业务开发类子流程",
			"children": {
				"10101": "审批业务需求",
				"10102": "提出架构建议",
				"10103": "审核架构建议"
			}
		},
		"010108": {
			"name": "外部IT应用和设备子流程",
			"children": {
				"10101": "审核业务需求",
				"10102": "提出架构建议",
				"10103": "审核架构建议"
			}
		},
		"020100": {
			"name": "定义项目主流程",
			"children": {
				"10101": "定义项目目标和范围",
				"10102": "组织定义架构要求",
				"10103": "安全架构师定义架构要求",
				"10104": "数据架构师定义架构要求",
				"10105": "技术架构师定义架构要求",
				"10106": "应用架构师定义架构要求",
				"10107": "组织定义架构要求",
				"10201": "编写项目立项材料",
				"10202": "审核项目材料",
				"10203": "审核需求分析",
				"10204": "安全架构师审核项目技术方案",
				"10205": "数据架构师审核项目技术方案",
				"10206": "技术架构师审核项目技术方案",
				"10207": "应用架构师审核项目技术方案",
				"10208": "出具技术方案审核意见",
				"10209": "IT部门项目初审人审核项目材料",
				"10210": "项目领域审核人审核项目材料",
				"10211": "IT部门项目初审人审核项目材料",
				"10212": "IT部门项目审核人审核项目材料",
				"10213": "IT部门项目初审人审核项目材料",
				"10214": "牵头提出部门联系人审核项目材料",
				"10215": "牵头提出部门联系人审核项目材料",
				"10216": "牵头提出部门审核人签署项目立项材料",
				"00001": "详情"

			}
		},
		"020101": {
			"name": "定义项目子流程其他部门审核",
			"children": {
				"10101": "审核项目材料",
				"10102": "其他提出部门联系人审核项目材料",
				"10103": "其他提出部门审核人签署项目立项材料",
				"10104": "审核项目材料",
				"00001": "详情"
			}
		},
		"020200": {
			"name": "项目变更申请",
			"children": {
				"10101": "编制项目变更材料",
				"10102": "审核项目变更材料",
				"10103": "审核需求分析",
				"10104": "安全架构师审核项目技术方案",
				"10105": "数据架构师审核项目技术方案",
				"10106": "技术架构师审核项目技术方案",
				"10107": "应用架构师审核项目技术方案",
				"10108": "出具技术方案审核意见",
				"10109": "IT部门项目初审人审核项目变更材料",
				"10110": "项目领域审核人审核项目变更材料",
				"10111": "IT部门项目初审人审核项目变更材料",
				"10112": "IT部门项目审核人审核项目变更材料",
				"10113": "IT部门项目初审人审核项目变更材料",
				"10114": "项目牵头提出部门联系人审核项目变更材料",
				"10115": "项目牵头提出部门联系人审核项目变更材料",
				"10116": "项目牵头提出部门审核人签署项目变更材料",
				"10117": "提出项目变更申请",
				"10201": "初审项目变更",
				"10202": "审核项目变更",
				"10203": "IT项目审批人(分管行长)审批项目变更",
				"10204": "IT项目审批人(信息委)审批项目变更",
				"10205": "IT项目审批人(行长)审批项目变更",
				"10206": "编制项目变更任务书",
				"10207": "签署项目变更任务书",
				"10208": "下达项目变更任务书",
				"10301": "组织出具技术方案审核意见",
				"00001": "详情"
			}
		},
		"020201": {
			"name": "变更项目子流程其他部门审核",
			"children": {
				"10101": "审核项目变更材料",
				"10102": "其它部门联系人审核项目变更材料",
				"10103": "其它提出部门审核人签署项目变更材料",
				"10104": "审核项目变更材料",
				"00001": "详情"
			}
		},
		"020202": {
			"name": "变更项目子流程编制项目技术方案",
			"children": {
				"10101": "项目经理提出项目变更申请",
				"10102": "系统设计师编制项目技术方案",
				"10103": "项目经理提出项目变更申请"
			}
		},
		"020203": {
			"name": "变更项目子流程分析需求",
			"children": {
				"10101": "项目经理提出项目变更申请",
				"10102": "业务分析师分析需求",
				"10103": "项目经理提出项目变更申请"
			}
		},
		"020300": {
			"name": "定义非项目主流程",
			"children": {
				"10101": "定义非项目目标和范围",
				"10102": "组织定义架构要求",
				"10103": "安全架构师定义架构要求",
				"10104": "数据架构师定义架构要求",
				"10105": "技术架构师定义架构要求",
				"10106": "应用架构师定义架构要求",
				"10107": "组织定义架构要求",
				"10201": "编写非项目立项材料",
				"10202": "实施部门项目审核人审核项目材料",
				"10203": "审核需求分析",
				"10204": "安全架构师审核项目技术方案",
				"10205": "数据架构师审核项目技术方案",
				"10206": "技术架构师审核项目技术方案",
				"10207": "应用架构师审核项目技术方案",
				"10208": "出具技术方案审核意见",
				"10209": "IT部门项目初审人审核项目材料",
				"10210": "项目领域审核人审核项目材料",
				"10211": "IT部门项目初审人审核项目材料",
				"10212": "IT部门项目审核人审核项目材料",
				"10213": "IT部门项目初审人审核项目材料",
				"10214": "提出部门联系人审核项目材料",
				"10215": "提出部门审核人签署项目立项材料",
				"00001": "详情"
			}
		},
		"020301": {
			"name": "定义非项目子流程估算项目",
			"children": {
				"10101": "项目分析师编写项目立项材料",
				"10102": "项目估算师估算项目",
				"10103": "项目分析师编写项目立项材料",
				"00001": "详情"
			}
		},
		"020302": {
			"name": "定义非项目子流程编制项目技术方案",
			"children": {
				"10101": "项目分析师编写项目立项材料",
				"10102": "系统设计师编制项目技术方案",
				"10103": "项目分析师编写项目立项材料"
			}
		},
		"020303": {
			"name": "定义非项目子流程分析需求",
			"children": {
				"10101": "项目分析师编写项目立项材料",
				"10102": "业务分析师分析需求",
				"10103": "项目分析师编写项目立项材料"
			}
		},
		"020400": {
			"name": "审批项目流程",
			"children": {
				"10101": "提出项目申请",
				"10102": "IT项目主管部门初审人初审项目",
				"10103": "IT项目主管部门审核人审核项目",
				"10104": "IT项目审批人(分管行长)审核项目",
				"10105": "IT项目审批人(信息委)审批项目",
				"10106": "IT项目审批人(行长)审批项目",
				"10107": "编制任务书",
				"10108": "签发任务书",
				"10109": "下达任务书",
				"00001": "详情"
			}
		},
		"020500": {
			"name": "审批非项目流程",
			"children": {
				"10101": "提出非项目申请",
				"10102": "初审非项目任务",
				"10103": "审核非项目任务",
				"10104": "编制任务书",
				"10105": "签发任务书",
				"10106": "下达任务书",
				"00001": "详情"
			}
		},
		"020600": {
			"name": "审批项目终止",
			"children": {
				"10101": "项目经理起草项目中止申请",
				"10102": "实施部门项目审核人初审项目中止",
				"10103": "牵头提出部门联系人初审项目中止",
				"10104": "牵头提出部门联系人初审项目中止",
				"10105": "牵头提出部门审核人初审项目中止",
				"10106": "项目经理提起项目中止申请",
				"10107": "IT业务关系经理初审项目中止",
				"10108": "IT项目主管部门初审人初审项目中止",
				"10109": "项目领域审核人初审项目中止",
				"10110": "IT项目主管部门初审人初审项目中止",
				"10111": "IT项目审核人审核项目中止",
				"10201": "IT项目审批人（分管行长）审批项目中止",
				"10202": "IT项目审批人（信息委）审批项目中止",
				"10203": "IT项目审批人（行长）审批项目中止",
				"10204": "IT项目主管部门初审人编制项目中止任务书",
				"10205": "IT项目审核人签发项目中止任务书",
				"10206": "IT项目主管部门初审人下达项目中止任务书",
				"00001": "详情"
			}
		},
		"020601": {
			"name": "初审项目终止子流程",
			"children": {
				"10101": "初审项目中止",
				"10102": "其他提出部门联系人初审项目中止",
				"10103": "其他提出部门审核人初审项目中止",
				"10104": "初审项目中止",
				"00001": "详情"
			}
		},
	};

	var crumbDiv = $("<ol>", {
		"class": "breadcrumb"
	}).html("当前位置：");

	var getInfo = function(data, node) {
		var tNode = node || menu;
		if ($.isArray(data) && data.length > 0) {
			tNode = tNode[data[0]];
			if ($.isPlainObject(tNode)) {

				crumbDiv.append("<li><span>" + tNode.name + "</span></li>");

				var tData = data.splice(1);

				if (tData.length) {
					getInfo(tData, tNode.children);
				}
			} else {
				crumbDiv.append("<li><span>" + tNode + "</span></li>");
			}
		}
	}

	return function() {
		var tplNo = location.search.getQueryString("tplNo") || $("#PTP_NO").val() || location.search.getQueryString("TODO_ITM_TPCD"),
			taskId = location.search.getQueryString("taskId") || $("#TASK_ID").val(),
			r = /^[0-9]+/g,
			tplId = tplNo && r.exec(tplNo),
			tplNode = menu[tplId],
			l = [];

		if (location.search.getQueryString("TODO_ITM_TPCD")) {
			taskId = '00001';
		}

		if (tplId) {
			l.push(tplId);
		}

		if (taskId) {
			l.push(taskId);
		}

		getInfo(l);

		return crumbDiv;
	}
}()